In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [26]:
# Tạo một DataFrame chứa thông tin về sản phẩm, danh mục, và doanh thu. 

df_products = pd.DataFrame({
    'product_id': [1, 2, 3, 4, 5,6],
    'category': ['Computer', 'Laptop', 'Tablet', 'Smartphone', 'Smartwatch', 'Laptop'],
    'revenue': [1999, 2999, 1500, 1999, 299, 1]
})

# TODO: Sử dụng groupby() để tính tổng doanh thu theo từng danh mục

In [63]:
grouped_category_df = df_products.groupby('category')
result=grouped_category_df.sum()
print(result['revenue'])

category
Computer      1999
Laptop        3000
Smartphone    1999
Smartwatch     299
Tablet        1500
Name: revenue, dtype: int64

In [2]:
# Tạo một DataFrame về thông tin nhân viên và lương và phòng ban. 

df_employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Jane', 'Jim', 'Jill', 'Jack'],
    'salary': [50000, 55000, 60000, 65000, 70000],
    'department': ['IT', 'HR', 'IT', 'HR', 'IT']
})

# TODO: Sử dụng groupby() để tính trung bình lương theo từng phòng ban

In [7]:
grouped_dep_df = df_employees.groupby('department')
result2 = grouped_dep_df['salary'].mean()
print(result2)

department
HR    60000.0
IT    60000.0
Name: salary, dtype: float64

In [11]:
# TODO: Thêm một cột mới chứa thông tin về tiền thưởng
df_employees['Allowance'] = [1000,2000,3000,4000,1000]
display(df_employees)

   employee_id  name  salary department  Allowance
0            1  John   50000         IT       1000
1            2  Jane   55000         HR       2000
2            3   Jim   60000         IT       3000
3            4  Jill   65000         HR       4000
4            5  Jack   70000         IT       1000

In [13]:
# TODO: Xóa một cột khỏi DataFrame chứa thông tin về nhân viên (ví dụ: xóa cột 'Tiền Thưởng')
df_employees = df_employees.drop('Allowance',axis=1)
display(df_employees)

   employee_id  name  salary department
0            1  John   50000         IT
1            2  Jane   55000         HR
2            3   Jim   60000         IT
3            4  Jill   65000         HR
4            5  Jack   70000         IT

In [14]:
# Tạo một DataFrame chứa thông tin về sản phẩm và giá cả
df_products = pd.DataFrame({
    'product_id': [1, 2, 3, 4, 5],
    'product_name': ['Laptop', 'Smartphone', 'Tablet', 'Smartwatch', 'Computer'],
    'price': [1999, 2999, 1500, 1999, 299]
})

# TODO: sắp xếp theo giá sản phẩm tăng dần

In [17]:
# TODO: sắp xếp theo giá, sau đó cùng giá sắp xếp theo tên sản phẩm
df_products_sort=df_products.sort_values(by=["price","product_name"],ascending=True)
print(df_products_sort)

   product_id product_name  price
4           5     Computer    299
2           3       Tablet   1500
0           1       Laptop   1999
3           4   Smartwatch   1999
1           2   Smartphone   2999

In [18]:
# Tạo một DataFrame chứa dữ liệu khoảng 10 dòng trong đó 3-4 dòng thiếu dữ liệu trong một cột giá.
df_products = pd.DataFrame({
    'product_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'product_name': ['Laptop', 'Smartphone', 'Tablet', 'Smartwatch', 'Computer', 'Laptop', 'Smartphone', 'Tablet', 'Smartwatch', 'Computer'],
    'price': [1999, None, 1500, None, 299, 1999, None, 1500, None, 299]
})

# TODO: thay thế các giá trị thiếu bằng giá trị trung bình của cột đó

In [19]:
display(df_products)

   product_id product_name   price
0           1       Laptop  1999.0
1           2   Smartphone     NaN
2           3       Tablet  1500.0
3           4   Smartwatch     NaN
4           5     Computer   299.0
5           6       Laptop  1999.0
6           7   Smartphone     NaN
7           8       Tablet  1500.0
8           9   Smartwatch     NaN
9          10     Computer   299.0

In [26]:
mean_df = {df_products['price'].mean():.2f}
print(mean_df)

SyntaxError: invalid decimal literal (4079483275.py, line 1)

In [ ]:
# convert 'Quantity' to integer
df['Quantity'] = df['Quantity'].str.replace(',', '.').astype(float).astype(int)

In [ ]:
# Tạo một DataFrame chứa thông tin về học sinh, bao gồm tên, lớp, và điểm thi.
df_students = pd.DataFrame({
    'student_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Jane', 'Jim', 'Jill', 'Jack', 'Mike', 'Sarah', 'Emily', 'David', 'Olivia'],
    'class': ['10A', '10B', '10A', '10B', '10A', '10A', '10B', '10A', '10B', '10A'],
    'score': [85, 90, 78, 92, 88, 95, 80, 90, 85, 92]
})

# TODO:  Nhóm theo lớp và tính điểm trung bình của từng lớp

In [ ]:
# Tạo một DataFrame chứa thông tin về các sản phẩm, bao gồm tên và giá.
df_products = pd.DataFrame({
    'product_id': [1, 2, 3, 4, 5],
    'product_name': ['Laptop', 'Smartphone', 'Tablet', 'Smartwatch', 'Computer', 'Camera', 'Printer', 'Speaker', 'Headphone', 'Keyboard'],
    'price': [1999, 2999, 1500, 1999, 299, 1999, 1500, 1999, 299, 1500]
})

# TODO: Tạo 1 cột giảm giá 10% cho các sản phẩm có giá trên 2000, các sản phẩm còn lại giảm 5%

In [ ]:
# Tạo một DataFrame chứa thông tin về các sản phẩm có doanh thu.
df_products = pd.DataFrame({
    'product_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'product_name': ['Laptop', 'Smartphone', 'Tablet', 'Smartwatch', 'Computer', 'Camera', 'Printer', 'Speaker', 'Headphone', 'Keyboard'],
    'revenue': [250000, 250000, 150000, 199900, 299000, 150000, 199900, 299000, 150000, 199900]
})

# TODO: Lọc các sản phẩm có doanh thu trên 200000